ИнКар.Маркетплейсы/src/InformationRegisters/МП_АвитоВсеОбъявления/МП_АвитоВсеОбъявления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_АвитоВсеОбъявления</name>
  <resources>
    <name>НазваниеОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>URLАдресОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторАвтозагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторАвито</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/УдалитьМП_АвитоИдентификаторыОбъявлений/УдалитьМП_АвитоИдентификаторыОбъявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьМП_АвитоИдентификаторыОбъявлений</name>
  <resources>
    <name>НазваниеОбъявления</name>
    <comment>&lt;Title>Бампер передний Audi A4 MW0218681&lt;/Title></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <comment>&lt;DateBegin>2015-12-24&lt;/DateBegin></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <comment>&lt;DateEnd>2079-08-28&lt;/DateEnd></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПлатногоРазмещения</name>
    <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
    <type>
      <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
    </type>
  </resources>
  <resources>
    <name>ПлатнаяУслуга</name>
    <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
    <type>
      <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
    </type>
  </resources>
  <resources>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Менеджер</name>
    <comment>&lt;ManagerName>Иван Петров-Водкин&lt;/ManagerName></comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерТелефона</name>
    <comment>&lt;ContactPhone>+7 495 777-10-66&lt;/ContactPhone></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <comment>&lt;Address>Россия, Тамбовская область, Моршанск, Лесная улица, 7&lt;/Address></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодкатегорияТовара</name>
    <comment>&lt;TypeId>16-814&lt;/TypeId></comment>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <resources>
    <name>ВидОбъявления</name>
    <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
    <type>
      <types>EnumRef.МП_АвитоВидыОбъявлений</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>&lt;Condition>Новое&lt;/Condition></comment>
    <type>
      <types>EnumRef.МП_АвитоСостояние</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <comment>&lt;Availability>Под заказ&lt;/Availability></comment>
    <type>
      <types>EnumRef.МП_АвитоДоступность</types>
    </type>
  </resources>
  <resources>
    <name>OEM</name>
    <comment>&lt;OEM>84501SC020&lt;/OEM></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусОбъявления</name>
    <comment>Статус объявления на сайте (можно указать несколько значений через запятую)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>URLАдресОбъявления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусРазмещенияНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСтатусОбработкиОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПредварительнойОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПубликоватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторАвито</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АйДи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_АвитоСтатусыЗагрузок/МП_АвитоСтатусыЗагрузок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_АвитоСтатусыЗагрузок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияВыгрузкиОбъявленийНаСайт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяСозданияОтчета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НазваниеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяГенерацииДанногоОтчета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОбщийСтатусВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce0d4416-9083-47d2-9ac4-20bebe7a8b22">
    <name>Резерв</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/Enums/МП_ВариантыПубликацииКартинок/МП_ВариантыПубликацииКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВариантыПубликацииКартинок</name>
  <enumValues>
    <name>НеПубликовать</name>
  </enumValues>
  <enumValues>
    <name>ТолькоОсновную</name>
  </enumValues>
  <enumValues>
    <name>ПубликоватьВсе</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_ВариантыФормированияНаличия/МП_ВариантыФормированияНаличия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВариантыФормированияНаличия</name>
  <enumValues>
    <name>ВсегдаВНаличии</name>
  </enumValues>
  <enumValues>
    <name>ВсегдаПодЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПоГруппеСкладов</name>
  </enumValues>
  <enumValues>
    <name>ПоОсновномуСкладу</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_АвитоДоступность/МП_АвитоДоступность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_АвитоДоступность</name>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>ПодЗаказ</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_АвитоВариантыПлатногоРазмещения/МП_АвитоВариантыПлатногоРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_АвитоВариантыПлатногоРазмещения</name>
  <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
  <enumValues>
    <name>Package</name>
    <comment>Размещение объявления осуществляется только при наличии подходящего пакета размещения</comment>
  </enumValues>
  <enumValues>
    <name>PackageSingle</name>
    <comment>При наличии подходящего пакета оплата размещения объявления произойдет с него; если нет подходящего пакета, но достаточно денег на кошельке Авито, то произойдет разовое размещение</comment>
  </enumValues>
  <enumValues>
    <name>Single</name>
    <comment>Только разовое размещение, произойдет при наличии достаточной суммы на кошельке Авито; если есть подходящий пакет размещения, он будет проигнорирован</comment>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_АвитоВидыОбъявлений/МП_АвитоВидыОбъявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_АвитоВидыОбъявлений</name>
  <enumValues>
    <name>ТоварПриобретенНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>ТоварОтПроизводителя</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/CommonModules/МП_АвитоВызовСервера/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ПрограммныйИнтерфейс

#Область МетодыПрофилей

Функция ОбновитьОбъявленияПрофиля(Профиль, ПоРегламенту = Ложь) Экспорт

	РезультатОбработки = НСтр("ru = 'Ошибка авторизации. Проверьте настройки профиля Авито и работоспособность интернета'");

	РеквизитыАвторизации = МП_АвитоВызовСервера.РеквизитыАвторизации(Профиль);

	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Авторизация на Авито...'"));
	Токен = МП_АвитоAPIКлиентСервер.ПолучитьТокен(РеквизитыАвторизации.Client_id, РеквизитыАвторизации.Client_secret);

	Если Токен <> Неопределено Тогда
		
		// Получение номера профиля
		ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Получение профиля Авито...'"));
		ИнформацияОПользователе = МП_АвитоAPIКлиентСервер.ПолучитьИнформациюОбАвторизованномПользователе(Токен);
		НомерПрофиля = ИнформацияОПользователе.НомерПрофиля;

		ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Получение объявлений с Авито...'"));
		СписокОбъявлений = МП_АвитоAPIКлиентСервер.ПолучениеИнформацииПоОбъявлениям(Токен);

		ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Получение отчета об автозагрузке с Авито...'"));
		СписокАвтозагрузок = МП_АвитоAPIКлиентСервер.ПолучитьДанныеПоследнегоАктуальногоОтчета(Токен, НомерПрофиля);

		// Сохраняем данные последнего отчета
		СохранитьСтатусОтчета(Профиль, СписокАвтозагрузок.ДанныеОтчета);

		ОбработаноОбъявлений = ОбработатьОбъявления(Профиль,
													СписокОбъявлений,
													СписокАвтозагрузок.СписокОбъявлений,
													Токен,
													НомерПрофиля);

		РезультатОбработки = СтрШаблон(НСтр("ru = 'Обработано %1 объявлений'"), ОбработаноОбъявлений);

	КонецЕсли;

	Возврат РезультатОбработки;

КонецФункции

Функция ОбновитьРучныеОбъявленияПрофиля(Профиль) Экспорт

	РезультатОбработки = НСтр("ru = 'Ошибка авторизации. Проверьте настройки профиля Авито и работоспособность интернета'");

	РеквизитыАвторизации = МП_АвитоВызовСервера.РеквизитыАвторизации(Профиль);

	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Авторизация на Авито...'"));
	Токен = МП_АвитоAPIКлиентСервер.ПолучитьТокен(РеквизитыАвторизации.Client_id, РеквизитыАвторизации.Client_secret);

	Если Токен <> Неопределено Тогда
		
		// Получение номера профиля
		ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Получение профиля Авито...'"));
		ИнформацияОПользователе = МП_АвитоAPIКлиентСервер.ПолучитьИнформациюОбАвторизованномПользователе(Токен);
		НомерПрофиля = ИнформацияОПользователе.НомерПрофиля;

		ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Получение объявлений с Авито...'"));
		СписокОбъявлений = МП_АвитоAPIКлиентСервер.ПолучениеИнформацииПоОбъявлениям(Токен);

		ОбработаноОбъявлений = ОбработатьРучныеОбъявления(Профиль, СписокОбъявлений, Токен, НомерПрофиля);

		РезультатОбработки = СтрШаблон(НСтр("ru = 'Обработано %1 объявлений'"), ОбработаноОбъявлений);

	КонецЕсли;

	Возврат РезультатОбработки;

КонецФункции

Функция ОбработатьРучныеОбъявления(Профиль, СписокОбъявлений, Токен, НомерПрофиля)

	ТипСтруктура = Тип("Структура");

	Счетчик = 0;
	
	// Очистка существующих записей профиля
	НаборЗаписей = РегистрыСведений.МП_АвитоВсеОбъявления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Профиль.Установить(Профиль, Истина);
	НаборЗаписей.Записать(Истина);
	
	// Заполнение новых записей
	Для Каждого Эл Из СписокОбъявлений Цикл

		Нечто = МП_АвитоAPIКлиентСервер.ПолучениеИнформацииПоОбъявлению(Токен, Эл.ИдентификаторАвито, НомерПрофиля);

		НоваяЗапись = РегистрыСведений.МП_АвитоВсеОбъявления.СоздатьМенеджерЗаписи();
		НоваяЗапись.Профиль = Профиль;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Эл);

		Если ТипЗнч(Нечто) = ТипСтруктура Тогда
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Нечто);
		КонецЕсли;

		НоваяЗапись.Записать(Истина);

		Счетчик = Счетчик + 1;

	КонецЦикла;

	Возврат Счетчик;

КонецФункции

// Сформировать файл автозагрузки авито.
// 
// Параметры:
//  Профиль - Профиль
// 
// Возвращаемое значение:
//  Строка - Сформировать файл автозагрузки авито
Функция СформироватьФайлАвтозагрузкиПрофиля(Профиль, ДополнительныеПараметры = Неопределено) Экспорт

	ТегБр = "<br>";

	ТегЮл = "<ul>";
	ТегЮлК = "</ul>";
	ТегЛи = "<li>";

	ШаблонИтога = "Сформирован файл автозагрузки Avito для профиля '%1' (%2 объявлений)";

	Шаг = 0;

	СформироватьФайлАвтозагрузкиАвито = "";

	// Начальное сообщение
	ДлительныеОперации.СообщитьПрогресс(Формат(0.01, "ЧДЦ=2;"), "Подготовка к формированию файла автозагрузки");

	Если ЗначениеЗаполнено(Профиль) Тогда

		// Перезапись всех записей регистра для профиля
		НаборЗаписей = РегистрыСведений.УдалитьМП_АвитоИдентификаторыОбъявлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Профиль.Установить(Профиль, Истина);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать(Истина);

		ПараметрыОбъявления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, Реквизиты());

		ПубликоватьВсеКартинки = (ПараметрыОбъявления.ПубликоватьКартинки
								  = Перечисления.МП_ВариантыПубликацииКартинок.ПубликоватьВсе);
		ПубликоватьВсеОстатки = (ПараметрыОбъявления.ВариантФормированияНаличия
								 = Перечисления.МП_ВариантыФормированияНаличия.ПоГруппеСкладов);
		ПубликоватьПрименимость = (Метаданные.НайтиПоПолномуИмени("Подсистема.АвтосервисАвтомагазин") <> Неопределено);

		ПубликоватьВидео = ЗначениеЗаполнено(ПараметрыОбъявления.РеквизитВидео);

		ПубликоватьЗоныПоказа = ПараметрыОбъявления.ИспользоватьЗоныПоказа;

		ЗапросОбъявлений = ИнициализироватьЗапросОбъявлений(Профиль);
		НаВыгрузку = ЗапросОбъявлений.Выполнить().Выбрать();

		ВсегоОбъявлений = НаВыгрузку.Количество();

		Если ВсегоОбъявлений > 0 Тогда

			// Получение коллекции зон показа
			Если ПубликоватьЗоныПоказа Тогда

				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Профиль", Профиль);
				Запрос.Текст = "ВЫБРАТЬ
							   |	ЗоныПоказа.НомерСтроки КАК НомерСтроки,
							   |	ЗоныПоказа.ЗонаПоказа.Наименование КАК НаименованиеЗоны
							   |ИЗ
							   |	Справочник.МП_АвитоПрофили.ЗоныПоказа КАК ЗоныПоказа
							   |ГДЕ
							   |	ЗоныПоказа.Ссылка = &Профиль
							   |
							   |УПОРЯДОЧИТЬ ПО
							   |	НомерСтроки";
				НаборЗонПоказа = Запрос.Выполнить().Выбрать();

				Если НаборЗонПоказа.Количество() < 1 Тогда
					ПубликоватьЗоныПоказа = Ложь;
				КонецЕсли;

			КонецЕсли;

			Если ПубликоватьВсеКартинки Тогда
				ЗапросКартинок = ИнициализироватьЗапросКартинок();
			КонецЕсли;

			Если ПубликоватьВсеОстатки Тогда
				КонтактныеДанныеСкладов = КонтактныеДанныеСкладов(Профиль);
			КонецЕсли;

			ПоляИзЗапроса = ПоляИзЗапроса();

			ПространствоИменАвито = ПространствоИменАвито();

			ДокDOM = Новый ДокументDOM(ПространствоИменАвито, "Ads");
			ДокDOM.ЭлементДокумента.УстановитьАтрибут("formatVersion", "3");
			ДокDOM.ЭлементДокумента.УстановитьАтрибут("target", "Avito.ru");
			ДокDOM.ЭлементДокумента.УдалитьАтрибут("xmlns");

			Если ПубликоватьЗоныПоказа Тогда

				ЗоныПоказаСписок = ДокDOM.СоздатьЭлемент("DisplayAreas");
				НаборЗон = Новый Массив;
				Пока НаборЗонПоказа.Следующий() Цикл
					НаборЗон.Добавить(НаборЗонПоказа.НаименованиеЗоны);
				КонецЦикла;

			КонецЕсли;

			Пока НаВыгрузку.Следующий() Цикл

				КартинкиСписок = Неопределено;
				ЕстьХарактеристики = Ложь;
				Доступность = Перечисления.МП_АвитоДоступность.ПодЗаказ;

				ОбъявлениеDOM = ДокDOM.СоздатьЭлемент("Ad");
				
				// Создание элементов из полей запроса
				Для Каждого Поле Из ПоляИзЗапроса Цикл
					Если ЗначениеЗаполнено(НаВыгрузку[Поле]) Тогда
						Элемент = ДокDOM.СоздатьЭлемент(Поле);
						ПолеНаВыгрзку = ?(ТипЗнч(НаВыгрузку[Поле]) = Тип("Число"),
										  Формат(НаВыгрузку[Поле], "ЧГ=0;"),
										  НаВыгрузку[Поле]);
						Элемент.ТекстовоеСодержимое = ПолеНаВыгрзку;
						ОбъявлениеDOM.ДобавитьДочерний(Элемент);
					КонецЕсли;
				КонецЦикла;

				// Секция картинок
				Если ПубликоватьВсеКартинки Тогда

					ЗапросКартинок.УстановитьПараметр("ВладелецФайла", НаВыгрузку.Номенклатура);

					УстановитьПривилегированныйРежим(Истина);
					НаборКартинок = ЗапросКартинок.Выполнить().Выбрать();
					УстановитьПривилегированныйРежим(Ложь);

					Если НаборКартинок.Количество() > 0 Тогда

						КартинкиСписок = ДокDOM.СоздатьЭлемент("Images");
						Пока НаборКартинок.Следующий() Цикл

							СтрокаКартинки = ПараметрыОбъявления.URLЗагрузки + НаборКартинок.ПутьКФайлу;

							КартинкаЭлемент = ДокDOM.СоздатьЭлемент("Image");
							КартинкаЭлемент.УстановитьАтрибут("url", СтрокаКартинки);
							КартинкиСписок.ДобавитьДочерний(КартинкаЭлемент);

						КонецЦикла;
					КонецЕсли;

				КонецЕсли;

				// Секция текст объявления

				ТО = Новый Массив;

				ТО.Добавить(ПараметрыОбъявления.Шапка);
				ТО.Добавить(Символы.ПС);

//				ТО.Добавить(ТегПи);
				ТО.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаВыгрузку.Номенклатура, "НаименованиеПолное"));
				ТО.Добавить(ТегБр);	//				ТО.Добавить(ТегПиК);
				ТО.Добавить(Символы.ПС);

				// Секция применимость
				Если ПубликоватьПрименимость Тогда

					Модели = Новый Массив;
					Выполнить ("Справочники.КА2_КлючиМоделей.НайтиПоНоменклатуре(НаВыгрузку.Номенклатура, НаВыгрузку.Характеристика, Модели)");

					Если Модели.Количество() > 0 Тогда

						ТО.Добавить(ПараметрыОбъявления.РазделительРазделов);
						ТО.Добавить(Символы.ПС);
//						ТО.Добавить(ТегПи);
						ТО.Добавить("Подходит для следующих моделей автомобилей:");
						ТО.Добавить(ТегБр);	//				ТО.Добавить(ТегПиК);
						ТО.Добавить(Символы.ПС);
						ВставитьНачалоСписка(ТО);

						Для Каждого Эл Из Модели Цикл
							ТО.Добавить(ТегЛи);
							ТО.Добавить(Эл);
							ТО.Добавить(Символы.ПС);
						КонецЦикла;

						ВставитьКонецСписка(ТО);
						ТО.Добавить(Символы.ПС);

					КонецЕсли;

				КонецЕсли;
				
				// Секция описание
				Если СтрДлина(НаВыгрузку.НоменклатураОписание) > 4 Тогда
//					ТО.Добавить(ТегПи);
					ТО.Добавить(НаВыгрузку.НоменклатураОписание);
					ТО.Добавить(ТегБр);	//				ТО.Добавить(ТегПиК);
					ТО.Добавить(Символы.ПС);
				КонецЕсли;
				Если ЕстьХарактеристики Тогда
					ТО.Добавить(Символы.ПС);
					ВставитьКонецСписка(ТО);
				КонецЕсли;
				
				// Секция остатки
				Если ПубликоватьВсеОстатки И Не НаВыгрузку.НеПубликоватьОстатки Тогда
					СформироватьРазделНаличие(Профиль,
											  КонтактныеДанныеСкладов,
											  Доступность,
											  ТО,
											  НаВыгрузку,
											  ПараметрыОбъявления);
				КонецЕсли;

				// Секция характеристики
				ДопРеквизиты = УправлениеСвойствами.ЗначенияСвойств(НаВыгрузку.Номенклатура, Истина, Ложь);

				Для Каждого ДР Из ДопРеквизиты Цикл
					РеквизитыДР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДР.Свойство, "Имя, Заголовок");
					Если МП_УниверсальныеМетодыВызовСервера.ДРПодлежитПубликации(РеквизитыДР.Имя) Тогда
						
						// При необходимости добавляем заголовок списка
						Если Не ЕстьХарактеристики Тогда

							ТО.Добавить(ПараметрыОбъявления.РазделительРазделов);
							ТО.Добавить(Символы.ПС);

//							ТО.Добавить(ТегПи);
							ТО.Добавить("Характеристики товара:");
							ТО.Добавить(ТегБр);	//				ТО.Добавить(ТегПиК);
							ТО.Добавить(Символы.ПС);

							ТО.Добавить(ТегЮл);

							ЕстьХарактеристики = Истина;
						КонецЕсли;

						ТО.Добавить(Символы.ПС);
						ТО.Добавить(ТегЛи);
						ТО.Добавить(РеквизитыДР.Заголовок);
						ТО.Добавить(" -- ");
						ТО.Добавить(Строка(ДР.Значение));
					КонецЕсли;

				КонецЦикла;

				Если ЕстьХарактеристики Тогда

					ТО.Добавить(Символы.ПС);
					ТО.Добавить(ТегЮлК);
					ТО.Добавить(Символы.ПС);

				КонецЕсли;

				ТО.Добавить(ПараметрыОбъявления.РазделительРазделов);
				ТО.Добавить(Символы.ПС);

				ТО.Добавить(ПараметрыОбъявления.Подвал);
				ТО.Добавить(Символы.ПС);

				ТекстОбъявления = СтрСоединить(ТО);

				// Создание элемента Description
				Элемент = ДокDOM.СоздатьЭлемент("Description");

				Секция = ДокDOM.СоздатьСекциюCDATA(ТекстОбъявления);
				Элемент.ДобавитьДочерний(Секция);

				ОбъявлениеDOM.ДобавитьДочерний(Элемент);

				// Создание элемента Availability
				Элемент = ДокDOM.СоздатьЭлемент("Availability");
				Элемент.ТекстовоеСодержимое = Строка(Доступность);
				ОбъявлениеDOM.ДобавитьДочерний(Элемент);

				Если КартинкиСписок <> Неопределено Тогда
					ОбъявлениеDOM.ДобавитьДочерний(КартинкиСписок);
				КонецЕсли;

				// Добавление видео
				Если ПубликоватьВидео Тогда

					НайденРеквизит = ДопРеквизиты.Найти(ПараметрыОбъявления.РеквизитВидео);

					Если НайденРеквизит <> Неопределено И ЗначениеЗаполнено(НайденРеквизит.Значение) Тогда

						VideoURL = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденРеквизит.Значение,
																			 "ПолноеНаименование");

						Элемент = ДокDOM.СоздатьЭлемент("VideoURL");
						Элемент.ТекстовоеСодержимое = VideoURL; // https://www.youtube.com/watch?v=EyRMSzZ-q6w

						ОбъявлениеDOM.ДобавитьДочерний(Элемент);

					КонецЕсли;

				КонецЕсли;
				
				// Добавление зон показа
				Если ПубликоватьЗоныПоказа Тогда
					ЗоныПоказаСписок = ДокDOM.СоздатьЭлемент("DisplayAreas");

					Для Каждого Зона Из НаборЗон Цикл

						ЗоныПоказаЭлемент = ДокDOM.СоздатьЭлемент("Area");
						ЗоныПоказаЭлемент.ТекстовоеСодержимое = Зона;
						ЗоныПоказаСписок.ДобавитьДочерний(ЗоныПоказаЭлемент);

					КонецЦикла;
					ОбъявлениеDOM.ДобавитьДочерний(ЗоныПоказаСписок);
				КонецЕсли;
				
				// Добавление объявления в документ
				ДокDOM.ЭлементДокумента.ДобавитьДочерний(ОбъявлениеDOM);

				Шаг = Шаг + 1;

				ТекстСообщения = СтрШаблон("Обработано %1 из %2 объявлений", Шаг, ВсегоОбъявлений);
				ДлительныеОперации.СообщитьПрогресс(Формат(Шаг / ВсегоОбъявлений * 100, "ЧДЦ=2;"), ТекстСообщения);

			КонецЦикла;

			СформироватьФайлАвтозагрузкиАвито = "Ок";

			// Сохранение ДокументDOM в файл
			Если ДокDOM.ЕстьДочерниеУзлы() Тогда
				МП_УниверсальныеМетодыВызовСервера.СохранитьДокументDOMВФайле(ДокDOM,
																			  ПараметрыОбъявления.ИмяФайлаВыгрузки,
																			  ПространствоИменАвито);
			КонецЕсли;

		Иначе
			СформироватьФайлАвтозагрузкиАвито = "Нет объявлений для публиуации";
		КонецЕсли;
	Иначе
		СформироватьФайлАвтозагрузкиАвито = "Не выбран профиль";
	КонецЕсли;

	// Передача результата обработки на клиент 
	ТекстСообщения = СтрШаблон(ШаблонИтога, Профиль, Шаг);
	ДополнительныеПараметры.Вставить("ТекстСообщения", ТекстСообщения);
	
	// Запись результата в журнал регистрации
	Уровень = УровеньЖурналаРегистрации.Информация;

	ЗаписьЖурналаРегистрации("Маркетплейсы.Avito.СформироватьФайлАвтозагрузкиПрофиля", Уровень,,, ТекстСообщения);

	Возврат СформироватьФайлАвтозагрузкиАвито;

КонецФункции

#КонецОбласти

#Область Прочее

// Возвращает Client_id и Client_secret профиля Авито
// 
// Параметры:
//  Профиль - СправочникСсылка.МП_АвитоПрофили - Профиль
// 
// Возвращаемое значение:
//  Структура - Реквизиты профиля:
// * Client_id - Строка - Идентификатор клиента
// * Client_secret - Строка - Секретный ключ клиента
Функция РеквизитыАвторизации(Профиль) Экспорт

	СписокРеквизитов = "Client_id, Client_secret";

	Если ЗначениеЗаполнено(Профиль) Тогда
		РеквизитыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, СписокРеквизитов);
	Иначе
		РеквизитыПрофиля = Новый Структура(СписокРеквизитов, "", "");
	КонецЕсли;

	Возврат РеквизитыПрофиля;

КонецФункции

Процедура ЗаполнитьНазваниеОбъявления(Элемент) Экспорт

	МаркиМодели = УправлениеСвойствами.ЗначениеСвойства(Элемент.Номенклатура, ПараметрыСеанса.МП_ПВХ_МаркиМодели);

	Если МаркиМодели <> Неопределено Тогда

		ТоварнаяКатегория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "ТоварнаяКатегория");
		НаименованиеТовара = ?(ЗначениеЗаполнено(ТоварнаяКатегория),
							   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварнаяКатегория, "Наименование"),
							   Неопределено);

		Если НаименованиеТовара <> Неопределено Тогда
			НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2", НаименованиеТовара, МаркиМодели));
		Иначе

			НаименованиеХарактеристики = ?(Элемент.Характеристика.Пустая(),
										   "",
										   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика,
																					 "Наименование"));
			НаименованиеНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Наименование");
			НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2 %3",
												  НаименованиеНоменклатуры,
												  НаименованиеХарактеристики,
												  МаркиМодели));
		КонецЕсли;

	Иначе

		НаименованиеХарактеристики = ?(Элемент.Характеристика.Пустая(),
									   "",
									   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика,
																				 "Наименование"));
		НаименованиеНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Наименование");

		НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2", НаименованиеНоменклатуры, НаименованиеХарактеристики));

	КонецЕсли;

	ДлинаНазванияОбъявления = СтрДлина(НазваниеОбъявления);

	Если ДлинаНазванияОбъявления > 50 Тогда
		НазваниеОбъявления = Лев(НазваниеОбъявления, 47) + "...";
	КонецЕсли;

	Элемент.НазваниеОбъявления = ?(ДлинаНазванияОбъявления > 0, НазваниеОбъявления, Элемент.НазваниеОбъявления);

КонецПроцедуры

Функция ОбновитьЗоныПоказа(ИмяФайла) Экспорт

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);

	Коллекция = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	Если ТипЗнч(Коллекция) = Тип("ОбъектXDTO") Тогда

		Для Каждого Элемент Из Коллекция.Area Цикл

			НайденЭлемент = Справочники.МП_АвитоЗоныПоказа.НайтиПоНаименованию(Элемент, Истина);

			Если НайденЭлемент.Пустая() Тогда

				НовыйЭлемент = Справочники.МП_АвитоЗоныПоказа.СоздатьЭлемент();
				НовыйЭлемент.Заполнить(Элемент);

				Попытка
					НовыйЭлемент.Записать();
				Исключение
					// TODO: Обработать ошибку записи элемента справочника
				КонецПопытки;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Возврат 0;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьОбъявления(Профиль, СписокОбъявлений, СписокАвтозагрузок, Токен, НомерПрофиля)

	ТекстСообщения = НСтр("ru = 'Обработка объявлений'");
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ВедущийМенеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "ВедущийМенеджер");
	ТелефонПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "ТелефонПоУмолчанию");
	АдресПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "АдресПоУмолчанию");

	ОбработаноОбъявлений = 0;

	КоличествоОбъявлений = СписокОбъявлений.Количество() / 100;
	ШагИтерации = Окр(КоличествоОбъявлений / 0.33, 0);

	// Инициализация запроса
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Объявления.Номенклатура КАК Номенклатура,
				   |	Объявления.Характеристика КАК Характеристика,
				   |	Объявления.Профиль КАК Профиль,
				   |	Объявления.ИдентификаторАвито КАК ИдентификаторАвито,
				   |	Объявления.АйДи КАК АйДи,
				   |	Объявления.НазваниеОбъявления КАК НазваниеОбъявления,
				   |	Объявления.ДатаНачала КАК ДатаНачала,
				   |	Объявления.ДатаОкончания КАК ДатаОкончания,
				   |	Объявления.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	Объявления.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	Объявления.ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт КАК ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт,
				   |	Объявления.Менеджер КАК Менеджер,
				   |	Объявления.НомерТелефона КАК НомерТелефона,
				   |	Объявления.Адрес КАК Адрес,
				   |	Объявления.КатегорияОбъявления КАК КатегорияОбъявления,
				   |	Объявления.ПодкатегорияТовара КАК ПодкатегорияТовара,
				   |	Объявления.ВидОбъявления КАК ВидОбъявления,
				   |	Объявления.Состояние КАК Состояние,
				   |	Объявления.Доступность КАК Доступность,
				   |	Объявления.OEM КАК OEM,
				   |	"""" КАК СтатусОбъявления,
				   |	Объявления.URLАдресОбъявления КАК URLАдресОбъявления,
				   |	Объявления.Идентификатор КАК Идентификатор,
				   |	Объявления.СтатусРазмещенияНаСайте КАК СтатусРазмещенияНаСайте,
				   |	Объявления.ОбщийСтатусОбработкиОбъявления КАК ОбщийСтатусОбработкиОбъявления,
				   |	Объявления.СтатусПредварительнойОбработки КАК СтатусПредварительнойОбработки
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоИдентификаторыОбъявлений КАК Объявления
				   |ГДЕ
				   |	Объявления.Профиль = &Профиль";
	Запрос.УстановитьПараметр("Профиль", Профиль);
	ВсеОбъявления = Запрос.Выполнить().Выгрузить();
		
	// Обработка сообщений
	ДлительныеОперации.СообщитьПрогресс(ОбработаноОбъявлений, ТекстСообщения);

	// Обработка отчета ПолучениеИнформацииПоОбъявлениям
	Для Каждого Объявление Из СписокОбъявлений Цикл

		// Подбор записи в ТЗ ВсеОбъявления
		СтрокаВсеОбъявления = ВсеОбъявления.Найти(Объявление.ИдентификаторАвито, "ИдентификаторАвито");
		Если СтрокаВсеОбъявления = Неопределено Тогда

			СтрокаВсеОбъявления = ВсеОбъявления.Добавить();
			СтрокаВсеОбъявления.Профиль = Профиль;
			СтрокаВсеОбъявления.Номенклатура = ПустаяНоменклатура;
			СтрокаВсеОбъявления.Характеристика = ПустаяХарактеристика;
			СтрокаВсеОбъявления.Адрес = АдресПоУмолчанию;
			СтрокаВсеОбъявления.ВариантПлатногоРазмещения = Перечисления.МП_АвитоВариантыПлатногоРазмещения.Package;
			СтрокаВсеОбъявления.ВидОбъявления = Перечисления.МП_АвитоВидыОбъявлений.ТоварПриобретенНаПродажу;
			СтрокаВсеОбъявления.ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт = Истина;
			СтрокаВсеОбъявления.КатегорияОбъявления = "Запчасти и аксессуары";
			СтрокаВсеОбъявления.Менеджер = ВедущийМенеджер;
			СтрокаВсеОбъявления.НомерТелефона = ТелефонПоУмолчанию;
			СтрокаВсеОбъявления.Состояние = Перечисления.МП_АвитоСостояние.Новое;

		КонецЕсли;

		// Получение дополнительной информации объявления		
		ДополнительнаяИнформация = МП_АвитоAPIКлиентСервер.ПолучениеИнформацииПоОбъявлению(Токен,
																						   Объявление.ИдентификаторАвито,
																						   НомерПрофиля);
		// Обновление строки ТЗ ВсеОбъявления данными Авито
		ЗаполнитьЗначенияСвойств(СтрокаВсеОбъявления, Объявление);
		Если ДополнительнаяИнформация <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаВсеОбъявления, ДополнительнаяИнформация);
		КонецЕсли;

		ОбработаноОбъявлений = ОбработаноОбъявлений + 1;

		// Информирование о прогрессе
		Если Не (ОбработаноОбъявлений % ШагИтерации) Тогда
			ДлительныеОперации.СообщитьПрогресс(Формат(ОбработаноОбъявлений / КоличествоОбъявлений, "ЧЦ=3; ЧДЦ="),
												ТекстСообщения);
		КонецЕсли;

	КонецЦикла;

	КоличествоОбъявлений = ВсеОбъявления.Количество() / 100;
	ШагИтерации = Окр(КоличествоОбъявлений / 0.33, 0);

	ОбработаноОбъявлений = 0;
	ТекстСообщения = НСтр("ru = 'Обработка данных автозагрузки'");
	Для Каждого Объявление Из ВсеОбъявления Цикл

		// Подбор записи в СписокАвтозагрузок по полю Идентификатор
		Для индекс = 0 По СписокАвтозагрузок.ВГраница() Цикл
			Если Не ПустаяСтрока(Объявление.Идентификатор)
				 И СписокАвтозагрузок[индекс].Идентификатор = Объявление.Идентификатор Тогда
				ЗаполнитьЗначенияСвойств(Объявление, СписокАвтозагрузок[индекс]);
				Прервать;
			КонецЕсли;
		КонецЦикла;

		ОбработаноОбъявлений = ОбработаноОбъявлений + 1;

		// Информирование о прогрессе
		Если Не (ОбработаноОбъявлений % ШагИтерации) Тогда
			ДлительныеОперации.СообщитьПрогресс(Формат(ОбработаноОбъявлений / КоличествоОбъявлений, "ЧЦ=3; ЧДЦ="),
												ТекстСообщения);
		КонецЕсли;

	КонецЦикла;
	
	// Обновление записей регистра
	ТекстСообщения = НСтр("ru = 'Обновление информации в ИБ'");
	ОбработаноОбъявлений = 0;

	Для Каждого Элемент Из ВсеОбъявления Цикл

		НаЗапись = РегистрыСведений.УдалитьМП_АвитоИдентификаторыОбъявлений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НаЗапись, Элемент);
		НаЗапись.Записать(Истина);

		ОбработаноОбъявлений = ОбработаноОбъявлений + 1;

		// Информирование о прогрессе
		Если Не (ОбработаноОбъявлений % ШагИтерации) Тогда
			ДлительныеОперации.СообщитьПрогресс(Формат(ОбработаноОбъявлений / КоличествоОбъявлений, "ЧЦ=3; ЧДЦ="),
												ТекстСообщения);
		КонецЕсли;

	КонецЦикла;

	Возврат ОбработаноОбъявлений;

КонецФункции

Процедура СохранитьСтатусОтчета(Профиль, ДанныеОтчета)

	НовыйСтатусЗагрузки = РегистрыСведений.МП_АвитоСтатусыЗагрузок.СоздатьМенеджерЗаписи();

	НовыйСтатусЗагрузки.Профиль = Профиль;
	НовыйСтатусЗагрузки.Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(НовыйСтатусЗагрузки, ДанныеОтчета);

	НовыйСтатусЗагрузки.Записать(Истина);

КонецПроцедуры

// Возвращает массив реквизитов профиля
// 
// Возвращаемое значение:
//  Массив - Реквизиты
Функция Реквизиты()

	Реквизиты = Новый Массив;

	Реквизиты.Добавить("URLЗагрузки");
	Реквизиты.Добавить("Шапка");
	Реквизиты.Добавить("РазделительРазделов");
	Реквизиты.Добавить("Подвал");
	Реквизиты.Добавить("ПубликоватьКартинки");
	Реквизиты.Добавить("ВариантФормированияНаличия");
	Реквизиты.Добавить("СкладОсновной");
	Реквизиты.Добавить("НаличиеШапка");
	Реквизиты.Добавить("НаличиеПодвал");
	Реквизиты.Добавить("СообщениеОНедоступности");
	Реквизиты.Добавить("ВариантПредставленияСкладов");
	Реквизиты.Добавить("ИмяФайлаВыгрузки");
	Реквизиты.Добавить("РеквизитВидео");
	Реквизиты.Добавить("ИспользоватьЗоныПоказа");

	Возврат Реквизиты

КонецФункции

Функция ПространствоИменАвито()

	Возврат "http://autoload.avito.ru";

КонецФункции

Процедура СформироватьРазделНаличие(Профиль, КонтактныеДанныеСкладов, Доступность, ТО, НаВыгрузку, ПараметрыОбъявления)

	ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

	ЗапросОстатки = ИнициализироватьЗапросОстатки(Профиль);

	ЗапросОстатки.УстановитьПараметр("Номенклатура", НаВыгрузку.Номенклатура);
	ЗапросОстатки.УстановитьПараметр("Характеристика", НаВыгрузку.Характеристика);

	Остатки = ЗапросОстатки.Выполнить().Выбрать();

	ВставитьРазделитель(ТО, ПараметрыОбъявления.РазделительРазделов);

	Если Остатки.Количество() > 0 Тогда

		ПредставлениеСкладов = ПараметрыОбъявления.ВариантПредставленияСкладов;
		ПубликоватьКоличество = Ложь;		// Жесткое отключение публиуации количества остатка

		ТО.Добавить(ПараметрыОбъявления.НаличиеШапка);
		ТО.Добавить(Символы.ПС);

		ВставитьНачалоСписка(ТО);

		Пока Остатки.Следующий() Цикл

			ТекущийСклад = Остатки.Склад;

			Если ТекущийСклад = ПараметрыОбъявления.СкладОсновной Тогда
				Доступность = Перечисления.МП_АвитоДоступность.ВНаличии;
			КонецЕсли;

			// Получение номера телефона склада
			ТелефонСклада = ТелефонСклада(КонтактныеДанныеСкладов, ТекущийСклад);
			
			// Получение адреса склада
			АдресСкладаБезИндекса = Неопределено;
			ГородСклада = Неопределено;

			АдресСклада(КонтактныеДанныеСкладов, ТекущийСклад, АдресСкладаБезИндекса, ГородСклада);

			ОстатокНаСайт = ?(Остатки.Остаток > 1, Строка(Остатки.Остаток), "в наличии");

			СтрокаОстаток = Строка(ТекущийСклад) + ?(ПубликоватьКоличество, " -- " + ОстатокНаСайт, "");

			ТО.Добавить(ТегиHTML.Ли);
			ТО.Добавить(ТегиHTML.Стронг);
			ТО.Добавить(СтрокаОстаток);
			ТО.Добавить(ТегиHTML.СтронгК);

			// Добавление контактной информации после наименования склада			
			Если ПредставлениеСкладов = Перечисления.МП_ВариантыПредставленияСкладов.СкладГород Тогда
				ТО.Добавить(" (");
				ТО.Добавить(ГородСклада);
				ТО.Добавить(")");
				ТО.Добавить(Символы.ПС);
			ИначеЕсли ПредставлениеСкладов = Перечисления.МП_ВариантыПредставленияСкладов.СкладТелефон Тогда
				ТО.Добавить(" (");
				ТО.Добавить(ТелефонСклада);
				ТО.Добавить(")");
				ТО.Добавить(Символы.ПС);
			ИначеЕсли ПредставлениеСкладов = Перечисления.МП_ВариантыПредставленияСкладов.СкладТелефонАдрес Тогда
				ТО.Добавить(" ");
				ТО.Добавить(ТелефонСклада);
				ТО.Добавить(" / ");
				ТО.Добавить(АдресСкладаБезИндекса);
				ТО.Добавить(Символы.ПС);
			КонецЕсли;

		КонецЦикла;

		ВставитьКонецСписка(ТО);

		ТО.Добавить(ПараметрыОбъявления.НаличиеПодвал);
		ТО.Добавить(Символы.ПС);

	Иначе

		ТО.Добавить(ПараметрыОбъявления.СообщениеОНедоступности);
		ТО.Добавить(Символы.ПС);

	КонецЕсли;

КонецПроцедуры

#Область КонтактныеДанные

Процедура АдресСклада(КонтактныеДанныеСкладов, Знач ТекущийСклад, АдресСкладаБезИндекса, ГородСклада)

	АдресСкладаСтрока = КонтактныеДанныеСкладов.НайтиСтроки(Новый Структура("Склад, Тип",
																			ТекущийСклад,
																			Перечисления.ТипыКонтактнойИнформации.Адрес));
	// Город склада
	ГородСклада = АдресСкладаСтрока[0].Город;
	ДлинаГородСклада = СтрДлина(ГородСклада);

	Если Сред(ГородСклада, ДлинаГородСклада - 1) = " г" Тогда
		ГородСклада = Лев(ГородСклада, ДлинаГородСклада - 2);
	КонецЕсли;
	
	// Адрес склада без индекса
	АдресСкладаБезИндекса = Сред(АдресСкладаСтрока[0].Представление, 9);
	АдресСкладаБезИндекса = СтрЗаменить(АдресСкладаБезИндекса, " г", "");

КонецПроцедуры

// Возвращает строковое представление телефона склада
// 
// Параметры:
//  КонтактныеДанныеСкладов - ТаблицаЗначений - Контактные данные складов
//  ТекущийСклад - СправочникСсылка.Склады - Текущий склад
// 
// Возвращаемое значение:
//  Строка - Телефон склада
Функция ТелефонСклада(КонтактныеДанныеСкладов, Знач ТекущийСклад)

	ПараметрыПоиска = Новый Структура("Склад, Тип", ТекущийСклад, Перечисления.ТипыКонтактнойИнформации.Телефон);

	НайденыСтроки = КонтактныеДанныеСкладов.НайтиСтроки(ПараметрыПоиска);

	Возврат ?(НайденыСтроки.Количество() > 0, НайденыСтроки[0].Представление, "");

КонецФункции

Функция КонтактныеДанныеСкладов(Профиль)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Склад", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Склад"));

	Запрос.Текст = "ВЫБРАТЬ
				   |	СкладыКонтактнаяИнформация.Тип КАК Тип,
				   |	СкладыКонтактнаяИнформация.Представление КАК Представление,
				   |	СкладыКонтактнаяИнформация.Ссылка КАК Склад,
				   |	СкладыКонтактнаяИнформация.Город КАК Город,
				   |	""<li><strong>"" + СкладыКонтактнаяИнформация.Представление + ""</strong> ("" + СкладыКонтактнаяИнформация.Город +
				   |		"")"" КАК ПредставлениеAvito
				   |ИЗ
				   |	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
				   |ГДЕ
				   |	СкладыКонтактнаяИнформация.Ссылка В ИЕРАРХИИ (&Склад)
				   |	И (СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
				   |	ИЛИ СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))";

	КонтактныеДанныеСкладов = Запрос.Выполнить().Выгрузить();

	Возврат КонтактныеДанныеСкладов

КонецФункции

#КонецОбласти

#Область ФорматированиеТекстаОбъявления

// Добавляет в массив формирования текста объявления тег <ul> и символ перевода строки
// 
// Параметры:
//  ТекстОбъявления - Массив - Текст объявления
Процедура ВставитьНачалоСписка(ТекстОбъявления)

	ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

	ТекстОбъявления.Добавить(ТегиHTML.Юл);
	ТекстОбъявления.Добавить(Символы.ПС);

КонецПроцедуры

// Добавляет в массив формирования текста объявления тег </ul> и символ перевода строки
// 
// Параметры:
//  ТекстОбъявления - Массив - Текст объявления
Процедура ВставитьКонецСписка(ТекстОбъявления)

	ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

	ТекстОбъявления.Добавить(ТегиHTML.ЮлК);
	ТекстОбъявления.Добавить(Символы.ПС);

КонецПроцедуры

// Добавляет в массив формирования текста объявления текст разделителя и символ перевода строки
// 
// Параметры:
//  ТекстОбъявления - Массив - Текст объявления
//  Разделитель - Строка - текст разделителя
Процедура ВставитьРазделитель(ТекстОбъявления, Разделитель)

	ТекстОбъявления.Добавить(Разделитель);
	ТекстОбъявления.Добавить(Символы.ПС);

КонецПроцедуры

#КонецОбласти

Функция ИнициализироватьЗапросОстатки(Профиль)

	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.УстановитьПараметр("Склад", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Склад"));
	ЗапросОстатки.УстановитьПараметр("СкладОсновной", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль,
																								"СкладОсновной"));
	ЗапросОстатки.Текст = "ВЫБРАТЬ
						  |	СУММА(РаспределениеЗапасов.Свободно) КАК Остаток,
						  |	РаспределениеЗапасов.Склад КАК Склад
						  |ИЗ
						  |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
						  |ГДЕ
						  |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						  |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
						  |	И РаспределениеЗапасов.Характеристика = &Характеристика
						  |	И РаспределениеЗапасов.Склад В ИЕРАРХИИ (&Склад)
						  |	И РаспределениеЗапасов.Свободно > 0
						  |СГРУППИРОВАТЬ ПО
						  |	РаспределениеЗапасов.Склад";

	Возврат ЗапросОстатки

КонецФункции

Функция ИнициализироватьЗапросОбъявлений(Профиль)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ПодкатегорииПустая", Справочники.МП_АвитоПодкатегорииТоваров.ПустаяСсылка());

	Запрос.Текст = "ВЫБРАТЬ
				   |	Объявления.Номенклатура КАК Номенклатура,
				   |	Объявления.Характеристика КАК Характеристика,
				   |	Объявления.Профиль КАК Профиль,
				   |	Объявления.ИдентификаторАвито КАК AvitoId,
				   |	Объявления.НазваниеОбъявления КАК Title,
				   |	Объявления.ДатаНачала КАК DateBegin,
				   |	Объявления.ДатаОкончания КАК DateEnd,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.ВариантПлатногоРазмещения) КАК ListingFee,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.ПлатнаяУслуга) КАК AdStatus,
				   |	Объявления.НомерТелефона КАК ContactPhone,
				   |	Объявления.Адрес КАК Address,
				   |	Объявления.КатегорияОбъявления КАК Category,
				   |	ВЫБОР
				   |		КОГДА Объявления.ПодкатегорияТовара <> &ПодкатегорииПустая
				   |			ТОГДА Объявления.ПодкатегорияТовара.Код
				   |		ИНАЧЕ """"
				   |	КОНЕЦ КАК TypeId,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.ВидОбъявления) КАК AdType,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.Состояние) КАК Condition,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.Доступность) КАК Availability,
				   |	Объявления.OEM КАК OEM,
				   |	Объявления.СтатусОбъявления КАК СтатусОбъявления,
				   |	Объявления.URLАдресОбъявления КАК URLАдресОбъявления,
				   |	Объявления.Идентификатор КАК ID,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.Номенклатура.Производитель) КАК Brand,
				   |	ПРЕДСТАВЛЕНИЕ(Объявления.Номенклатура.Описание) КАК НоменклатураОписание,
				   |	Профили.ВариантФормированияНаличия КАК ВариантФормированияНаличия,
				   |	Профили.ВидЦены КАК ВидЦены,
				   |	ПРЕДСТАВЛЕНИЕ(Профили.ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт) КАК AllowEmail,
				   |	Профили.РазделительРазделов КАК РазделительРазделов,
				   |	Профили.Подвал КАК Подвал,
				   |	Профили.Шапка КАК Шапка,
				   |	Профили.Склад КАК Склад,
				   |	Профили.СкладОсновной КАК СкладОсновной,
				   |	Профили.Скидка КАК Скидка,
				   |	Объявления.Номенклатура.Артикул КАК НоменклатураАртикул,
				   |	Объявления.Номенклатура.ФайлКартинки КАК НоменклатураФайлКартинки,
				   |	ВЫРАЗИТЬ(ЕСТЬNULL(Цены.Цена, 0) * (100 - Профили.Скидка) / 100 КАК ЧИСЛО(15, 0)) КАК Price,
				   |	ЕСТЬNULL(ФизическиеЛица.Имя, ""Менеджер"") КАК ManagerName,
				   |	Объявления.НеПубликоватьОстатки КАК НеПубликоватьОстатки,
				   |	Профили.ИспользоватьЗоныПоказа КАК ИспользоватьЗоныПоказа
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоИдентификаторыОбъявлений КАК Объявления
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_АвитоПрофили КАК Профили
				   |		ПО Объявления.Профиль = Профили.Ссылка
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК Цены
				   |		ПО Цены.Номенклатура = Объявления.Номенклатура
				   |		И Цены.Характеристика = Объявления.Характеристика
				   |		И Цены.ВидЦены = Профили.ВидЦены
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
				   |		ПО Объявления.Менеджер.ФизическоеЛицо = ФизическиеЛица.Ссылка
				   |ГДЕ
				   |	Объявления.Идентификатор <> """"
				   |	И Объявления.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				   |	И Объявления.Профиль = &Профиль";
	Возврат Запрос

КонецФункции

Функция ПоляИзЗапроса()

	ПоляИзЗапроса = Новый Массив;

	ПоляИзЗапроса.Добавить("AvitoId");
	ПоляИзЗапроса.Добавить("Title");
//	ПоляИзЗапроса.Добавить("DateBegin");
//	ПоляИзЗапроса.Добавить("DateEnd");
	ПоляИзЗапроса.Добавить("ListingFee");
	ПоляИзЗапроса.Добавить("AdStatus");
	ПоляИзЗапроса.Добавить("ContactPhone");
	ПоляИзЗапроса.Добавить("Address");
	ПоляИзЗапроса.Добавить("Category");
	ПоляИзЗапроса.Добавить("TypeId");
	ПоляИзЗапроса.Добавить("AdType");
	ПоляИзЗапроса.Добавить("Condition");
	ПоляИзЗапроса.Добавить("Availability");
	ПоляИзЗапроса.Добавить("OEM");
	ПоляИзЗапроса.Добавить("ID");
	ПоляИзЗапроса.Добавить("Brand");
	ПоляИзЗапроса.Добавить("AllowEmail");
	ПоляИзЗапроса.Добавить("Price");
	ПоляИзЗапроса.Добавить("ManagerName");

	Возврат ПоляИзЗапроса;

КонецФункции

Функция ИнициализироватьЗапросКартинок()

	Перем ЗапросКартинок;
	ЗапросКартинок = Новый Запрос;
	ЗапросКартинок.УстановитьПараметр("ТипХраненияФайла", Перечисления.ТипыХраненияФайлов.ВТомахНаДиске);

	ЗапросКартинок.Текст = "ВЫБРАТЬ
						   |	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
						   |	НоменклатураПрисоединенныеФайлы.Том.ПолныйПутьWindows КАК Том
						   |ИЗ
						   |	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
						   |ГДЕ
						   |	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла = &ТипХраненияФайла
						   |	И НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	Возврат ЗапросКартинок

КонецФункции

#КонецОбласти
